{"posts":[{"title":"Blog Gratis Pakai Hexo dan Gitpage !","text":"Hi! Selamat datang di postingan pertama gw pakai Framework SSG HEXO + Gitpage. Solusi Blogging Gratis tanpa biaya loh, asli Rp 0 ini buat blog nya. Cukup modal akun github saja, tanpa domain, tanpa hosting, bisa post sepuasnya. Keuntungan Anti Hack, 100% aman dari Pentest, SQL Injection, Bug dan lainnya, kecuali akun github lu kena hack ya. Loading yang super cepat, karena ringan dan ya memang aslinya ini file static, tapi lihat sendiri aja tampilannya, cantik bukan ? Tidak perlu domain, karena bisa pakai repo nya github. Tidak perlu hosting, karena file nya akan di simpan di repo github. Full customize selama lu tahu apa yang lu kerjakan. Ngetik cepat karena semua perintah harus menggunakan CLI. Di cintai oleh bot Index karena halamannya memang cepat dan ringan. Thema custom yang melimpah Kekurangan Di butuhkan pengetahuan lebih khususnya dengan pengoperasian CLI Agak repot ketika harus buat postingan baru, page baru, atau menu baru kalau belum paham. Butuh waktu menyesuaikan Komunitas dan dev aslinya dari China, jadi agak susah kalau nimbrung. Apa Itu Hexo?Hexo adalah sebuah Static Site Generator (SSG) yang dibangun dengan Node.js. Hexo memungkinkan Anda untuk membuat blog atau situs web statis dengan cepat dan mudah. Keunggulan utama Hexo adalah: Cepat: Hexo menghasilkan file statis yang ringan, sehingga blog Anda dapat dimuat dengan cepat. Mudah Digunakan: Hexo menggunakan Markdown untuk penulisan konten, sehingga Anda tidak perlu repot dengan HTML atau CSS. Tema yang Estetik: Hexo memiliki banyak tema yang indah dan responsif, seperti tema Icarus yang sedang Anda gunakan. Kenapa Memilih Hexo? Gratis: Hexo sepenuhnya gratis dan open-source. Fleksibel: Anda dapat menyesuaikan blog Anda dengan berbagai plugin dan tema. Deploy Mudah: Hexo mendukung deployment ke GitHub Pages, Netlify, Vercel, dan platform lainnya jika anda sudah khatam tentunya.","link":"/2025/03/08/Hexo/"}],"tags":[{"name":"Blog","slug":"Blog","link":"/tags/Blog/"},{"name":"Umum","slug":"Umum","link":"/tags/Umum/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"}],"categories":[],"pages":[]}